In [1]:
import pandas as pd
import numpy as np

In [2]:
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [6]:
data = pd.read_csv("Friend_Training_.csv")

In [7]:
data.head()

,Person_1,Person_2,Friends,Years_Known,Type_Of_Interaction,Duration_Of_Interaction,Moon_Phase
0,Eric,Rachel,True,1.65,Class,0.00,Waxing_Gibbous
1,Justin,Helen,False,1.94,Over a Meal,7.29,First_Quarter
2,Austin,Theresa,False,1.28,Over a Meal,6.08,Waxing_Gibbous
3,Robert,Rebecca,False,0.00,At Work,7.35,Full_Moon
4,Jesse,Kathleen,True,3.41,Over a Meal,9.82,Waxing_Gibbous

In [8]:
data_1 = data.drop(["Person_2"],axis = 1) #here i needed person1 column so dropped person 2 column
data_2 = data.drop(["Person_1"],axis = 1) #viceversa as the above line
data_1 = data_1.rename(columns = {'Person_1':'Person'}) # now i renamed column so there wont be any problem during concatenation
data_2 = data_2.rename(columns = {'Person_2':'Person'})
c_data = data_1.append(data_2)            # now i appended the two dataframes on with person1 and one with person2
c_data.reset_index(drop = True,inplace = True) # dont forget to reset index while you append dataframes if there is no intension to saperate them again

In [9]:
c_data.head()

,Person,Friends,Years_Known,Type_Of_Interaction,Duration_Of_Interaction,Moon_Phase
0,Eric,True,1.65,Class,0.00,Waxing_Gibbous
1,Justin,False,1.94,Over a Meal,7.29,First_Quarter
2,Austin,False,1.28,Over a Meal,6.08,Waxing_Gibbous
3,Robert,False,0.00,At Work,7.35,Full_Moon
4,Jesse,True,3.41,Over a Meal,9.82,Waxing_Gibbous

In [10]:
c_data.describe()

         Years_Known  Duration_Of_Interaction
count  109394.000000            109394.000000
mean        3.316479                10.050735
std         2.618961                 4.908431
min         0.000000                 0.000000
25%         1.060000                 6.630000
50%         3.060000                 9.990000
75%         5.130000                13.390000
max        15.260000                30.860000

In [18]:
arr = c_data.Person.unique()

In [22]:
len(arr)

200

In [56]:
x = c_data[c_data['Friends'] == True].groupby('Person').Person.count()

In [58]:
x.head(20)

Person
Aaron        261
Abigail      313
Adam         272
Alan         299
Albert       349
Alexander    291
Alexis       242
Alice        262
Amanda       195
Amber        263
Amy          269
Andrea       258
Andrew       161
Angela       303
Ann          308
Anna         309
Anthony      283
Arthur       258
Ashley       343
Austin       271
Name: Person, dtype: int64

In [59]:
data.head()

,Person_1,Person_2,Friends,Years_Known,Type_Of_Interaction,Duration_Of_Interaction,Moon_Phase
0,Eric,Rachel,True,1.65,Class,0.00,Waxing_Gibbous
1,Justin,Helen,False,1.94,Over a Meal,7.29,First_Quarter
2,Austin,Theresa,False,1.28,Over a Meal,6.08,Waxing_Gibbous
3,Robert,Rebecca,False,0.00,At Work,7.35,Full_Moon
4,Jesse,Kathleen,True,3.41,Over a Meal,9.82,Waxing_Gibbous

In [99]:
a = data[data['Friends'] == True].groupby('Person_1',sort = False).Person_1.count()